load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Warm up"
    - duration: 60
      arrivalRate: 50
      rampTo: 200
      name: "Ramp up to peak load"
    - duration: 300
      arrivalRate: 200
      name: "Sustained load"

scenarios:
  - name: "WebSocket Scenario"
    engine: "socketio"
    flow:
      - emit:
          channel: "message"
          data: "Hello World!"
      - think: 1
      - emit:
          channel: "message"
          data: "Hello World!"
      - think: 1
      - emit:
          channel: "message"
          data: "Hello World!"

  - name: "HTTP Scenario"
    flow:
      - post:
          url: "/"
          expect:
            - statusCode: 201
            - contentType: "text/html"
            - equals: "Hello World!"
      - think: 1
      - post:
          url: "/"
          expect:
            - statusCode: 201
            - contentType: "text/html"
            - equals: "Hello World!"
      - think: 1
      - post:
          url: "/"
          expect:
            - statusCode: 201
            - contentType: "text/html"
            - equals: "Hello World!"